
## Plan Result

[CI link](https://github.com/NaokiYazawa/aws-ecs-terraform/actions/runs/3819263890)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * aws_ecs_service.ecs_service
* Replace
  * aws_ecs_task_definition.ecs_task_definition


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_service.ecs_service will be updated in-place
  ~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:ap-northeast-1:761817748648:service/go-simple-server/go-simple-server"
        name                               = "go-simple-server"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-1:761817748648:task-definition/go-simple-server:1" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.ecs_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "ecs_task_definition" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:761817748648:task-definition/go-simple-server:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  - environment      = [] -> null
                  ~ image            = "761817748648.dkr.ecr.ap-northeast-1.amazonaws.com/go-simple-server:99b26439529d13af34440227b879a3165dc492ec" -> "761817748648.dkr.ecr.ap-northeast-1.amazonaws.com/go-simple-server:85356e4bc8cf36cb12ea809a9eafc861a770f789"
                  - mountPoints      = [] -> null
                    name             = "go-simple-server"
                  - volumesFrom      = [] -> null
                    # (3 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "go-simple-server" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":14,"Program":"tfcmt","SHA1":"ad1941d7a2cf5194fd0efd87635b7528eb3c262e","Vars":{},"WorkflowName":"Terraform"} -->